app/controllers/books_controller.rb

SELECT "categories".* FROM "categories"
SELECT "books".* FROM "books" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fantasy"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."category_id" = ? ORDER BY created_at DESC  [["category_id", 1]]
---
	def index
		if params[:category].blank?
			@books = Book.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@books = Book.where(:category_id => @category_id).order("created_at DESC")

SELECT "categories".* FROM "categories"
---
  def new
    @book = current_user.books.build
    @categories = Category.all.map{ |c| [c.name,c.id] }

INSERT INTO "books" ("title", "description", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["author", ""], ["created_at", "2018-11-18 14:16:22.999014"], ["updated_at", "2018-11-18 14:16:22.999014"]]
---
  def create
    @book = current_user.books.build(book_params)
    @book.category_id = params[:category_id]

    if @book.save

SELECT "categories".* FROM "categories"
---
  def edit
    @categories = Category.all.map{ |c| [c.name, c.id] }

UPDATE "books" SET "category_id" = ?, "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["category_id", 3], ["title", "Tom and Jerry!!!"], ["updated_at", "2018-11-30 03:01:38.206708"], ["id", 6]]
---
  def update
    @book.category_id = params[:category_id]
    if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_book
      @book = Book.find(params[:id])